[net]
batch=1
subdivisions=1
height=9
width=8
channels=1
momentum=0.9
decay=0.0005

burn_in=10000
learning_rate=0.0027
policy=constant
power=4
max_batches=1000000000000

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=relu10

[maxpool]
size=2
stride=2

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=relu10

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=relu10

[maxpool]
size=2
stride=2

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=relu10

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=relu10

[maxpool]
size=2
stride=2

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=relu10

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=relu10

[maxpool]
size=2
stride=2

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=relu10

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=relu10

[convolutional]
filters=32
size=1
stride=1
pad=1
activation=relu10

[maxpool]
size=2
stride=2

[connected]
output=32
activation=relu10

[maxpool]
size=2
stride=2

[connected]
output=512
activation=relu10

[connected]
output=128
activation=relu10

[connected]
output=4672
activation=linear

[cost]
type=sse
